tests/load/output.txt
Test run id: te6ej_paxjck6zj8wygyr9jhgyhjwjxf7r7_p74x
Phase started: Warm-up (index: 0, duration: 15s) 06:29:23(+0700)

Phase completed: Warm-up (index: 0, duration: 15s) 06:29:38(+0700)

Phase started: Ramp-up (index: 1, duration: 30s) 06:29:38(+0700)

--------------------------------------
Metrics for period to: 06:29:30(+0700) (width: 5.446s)
--------------------------------------

errors.ECONNREFUSED: ........................................................... 2
errors.ECONNRESET: ............................................................. 2
errors.Failed capture or match: ................................................ 5
http.codes.200: ................................................................ 3
http.codes.500: ................................................................ 5
http.downloaded_bytes: ......................................................... 34932
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 12
http.response_time:
  min: ......................................................................... 242
  max: ......................................................................... 1019
  mean: ........................................................................ 580.9
  median: ...................................................................... 441.5
  p95: ......................................................................... 982.6
  p99: ......................................................................... 982.6
http.response_time.2xx:
  min: ......................................................................... 441
  max: ......................................................................... 988
  mean: ........................................................................ 752.3
  median: ...................................................................... 820.7
  p95: ......................................................................... 820.7
  p99: ......................................................................... 820.7
http.response_time.5xx:
  min: ......................................................................... 242
  max: ......................................................................... 1019
  mean: ........................................................................ 478
  median: ...................................................................... 267.8
  p95: ......................................................................... 608
  p99: ......................................................................... 608
http.responses: ................................................................ 8
vusers.completed: .............................................................. 2
vusers.created: ................................................................ 12
vusers.created_by_name.Browse User Profile: .................................... 2
vusers.created_by_name.Full Assessment Attempt Flow: ........................... 8
vusers.created_by_name.List Assessments and Chapters: .......................... 2
vusers.failed: ................................................................. 9
vusers.session_length:
  min: ......................................................................... 879
  max: ......................................................................... 1039.6
  mean: ........................................................................ 959.3
  median: ...................................................................... 871.5
  p95: ......................................................................... 871.5
  p99: ......................................................................... 871.5


--------------------------------------
Metrics for period to: 06:29:40(+0700) (width: 9.308s)
--------------------------------------

errors.Failed capture or match: ................................................ 11
http.codes.200: ................................................................ 14
http.codes.500: ................................................................ 11
http.downloaded_bytes: ......................................................... 177370
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 25
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 340
  mean: ........................................................................ 163.8
  median: ...................................................................... 175.9
  p95: ......................................................................... 290.1
  p99: ......................................................................... 327.1
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 205
  mean: ........................................................................ 76.6
  median: ...................................................................... 85.6
  p95: ......................................................................... 175.9
  p99: ......................................................................... 175.9
http.response_time.5xx:
  min: ......................................................................... 246
  max: ......................................................................... 340
  mean: ........................................................................ 274.8
  median: ...................................................................... 262.5
  p95: ......................................................................... 327.1
  p99: ......................................................................... 327.1
http.responses: ................................................................ 25
vusers.completed: .............................................................. 9
vusers.created: ................................................................ 23
vusers.created_by_name.Browse User Profile: .................................... 7
vusers.created_by_name.Full Assessment Attempt Flow: ........................... 11
vusers.created_by_name.List Assessments and Chapters: .......................... 5
vusers.failed: ................................................................. 11
vusers.session_length:
  min: ......................................................................... 90.3
  max: ......................................................................... 1641.3
  mean: ........................................................................ 400.9
  median: ...................................................................... 147
  p95: ......................................................................... 1022.7
  p99: ......................................................................... 1022.7


Phase completed: Ramp-up (index: 1, duration: 30s) 06:30:08(+0700)

Phase started: Sustained load (index: 2, duration: 30s) 06:30:08(+0700)

--------------------------------------
Metrics for period to: 06:29:50(+0700) (width: 9.462s)
--------------------------------------

errors.Failed capture or match: ................................................ 45
http.codes.200: ................................................................ 43
http.codes.500: ................................................................ 45
http.downloaded_bytes: ......................................................... 535887
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 92
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 948
  mean: ........................................................................ 196.5
  median: ...................................................................... 242.3
  p95: ......................................................................... 424.2
  p99: ......................................................................... 518.1
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 307
  mean: ........................................................................ 46
  median: ...................................................................... 2
  p95: ......................................................................... 165.7
  p99: ......................................................................... 237.5
http.response_time.5xx:
  min: ......................................................................... 237
  max: ......................................................................... 948
  mean: ........................................................................ 340.3
  median: ...................................................................... 314.2
  p95: ......................................................................... 459.5
  p99: ......................................................................... 518.1
http.responses: ................................................................ 88
vusers.completed: .............................................................. 29
vusers.created: ................................................................ 77
vusers.created_by_name.Browse User Profile: .................................... 15
vusers.created_by_name.Full Assessment Attempt Flow: ........................... 48
vusers.created_by_name.List Assessments and Chapters: .......................... 14
vusers.failed: ................................................................. 45
vusers.session_length:
  min: ......................................................................... 85
  max: ......................................................................... 1077.1
  mean: ........................................................................ 608.7
  median: ...................................................................... 1002.4
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1064.4


--------------------------------------
Metrics for period to: 06:30:00(+0700) (width: 9.891s)
--------------------------------------

errors.Failed capture or match: ................................................ 77
http.codes.200: ................................................................ 63
http.codes.500: ................................................................ 77
http.downloaded_bytes: ......................................................... 650028
http.request_rate: ............................................................. 16/sec
http.requests: ................................................................. 138
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 526
  mean: ........................................................................ 194.6
  median: ...................................................................... 247.2
  p95: ......................................................................... 376.2
  p99: ......................................................................... 497.8
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 313
  mean: ........................................................................ 64.3
  median: ...................................................................... 3
  p95: ......................................................................... 206.5
  p99: ......................................................................... 262.5
http.response_time.5xx:
  min: ......................................................................... 238
  max: ......................................................................... 526
  mean: ........................................................................ 301.2
  median: ...................................................................... 278.7
  p95: ......................................................................... 432.7
  p99: ......................................................................... 518.1
http.responses: ................................................................ 140
vusers.completed: .............................................................. 46
vusers.created: ................................................................ 122
vusers.created_by_name.Browse User Profile: .................................... 29
vusers.created_by_name.Full Assessment Attempt Flow: ........................... 76
vusers.created_by_name.List Assessments and Chapters: .......................... 17
vusers.failed: ................................................................. 77
vusers.session_length:
  min: ......................................................................... 84.6
  max: ......................................................................... 1060.3
  mean: ........................................................................ 446.8
  median: ...................................................................... 172.5
  p95: ......................................................................... 1022.7
  p99: ......................................................................... 1022.7


--------------------------------------
Metrics for period to: 06:30:10(+0700) (width: 9.958s)
--------------------------------------

errors.Failed capture or match: ................................................ 102
http.codes.200: ................................................................ 100
http.codes.500: ................................................................ 102
http.downloaded_bytes: ......................................................... 1282740
http.request_rate: ............................................................. 22/sec
http.requests: ................................................................. 207
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 764
  mean: ........................................................................ 242.6
  median: ...................................................................... 252.2
  p95: ......................................................................... 620.3
  p99: ......................................................................... 671.9
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 538
  mean: ........................................................................ 91.9
  median: ...................................................................... 2
  p95: ......................................................................... 459.5
  p99: ......................................................................... 539.2
http.response_time.5xx:
  min: ......................................................................... 240
  max: ......................................................................... 764
  mean: ........................................................................ 390.3
  median: ...................................................................... 354.3
  p95: ......................................................................... 645.6
  p99: ......................................................................... 671.9
http.responses: ................................................................ 202
vusers.completed: .............................................................. 66
vusers.created: ................................................................ 175
vusers.created_by_name.Browse User Profile: .................................... 34
vusers.created_by_name.Full Assessment Attempt Flow: ........................... 107
vusers.created_by_name.List Assessments and Chapters: .......................... 34
vusers.failed: ................................................................. 102
vusers.session_length:
  min: ......................................................................... 91.7
  max: ......................................................................... 1063.8
  mean: ........................................................................ 636.2
  median: ...................................................................... 539.2
  p95: ......................................................................... 1022.7
  p99: ......................................................................... 1043.3


--------------------------------------
Metrics for period to: 06:30:20(+0700) (width: 9.953s)
--------------------------------------

errors.Failed capture or match: ................................................ 108
http.codes.200: ................................................................ 113
http.codes.500: ................................................................ 108
http.downloaded_bytes: ......................................................... 1476821
http.request_rate: ............................................................. 24/sec
http.requests: ................................................................. 239
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 1964
  mean: ........................................................................ 835.1
  median: ...................................................................... 788.5
  p95: ......................................................................... 1826.6
  p99: ......................................................................... 1901.1
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 1876
  mean: ........................................................................ 403.6
  median: ...................................................................... 1
  p95: ......................................................................... 1686.1
  p99: ......................................................................... 1790.4
http.response_time.5xx:
  min: ......................................................................... 392
  max: ......................................................................... 1964
  mean: ........................................................................ 1286.7
  median: ...................................................................... 1380.5
  p95: ......................................................................... 1901.1
  p99: ......................................................................... 1939.5
http.responses: ................................................................ 221
vusers.completed: .............................................................. 74
vusers.created: ................................................................ 200
vusers.created_by_name.Browse User Profile: .................................... 45
vusers.created_by_name.Full Assessment Attempt Flow: ........................... 116
vusers.created_by_name.List Assessments and Chapters: .......................... 39
vusers.failed: ................................................................. 108
vusers.session_length:
  min: ......................................................................... 305
  max: ......................................................................... 1879.6
  mean: ........................................................................ 1161.1
  median: ...................................................................... 1022.7
  p95: ......................................................................... 1720.2
  p99: ......................................................................... 1826.6


--------------------------------------
Metrics for period to: 06:30:30(+0700) (width: 9.937s)
--------------------------------------

errors.Failed capture or match: ................................................ 109
http.codes.200: ................................................................ 125
http.codes.500: ................................................................ 109
http.downloaded_bytes: ......................................................... 1628630
http.request_rate: ............................................................. 24/sec
http.requests: ................................................................. 244
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 2313
  mean: ........................................................................ 1149
  median: ...................................................................... 1525.7
  p95: ......................................................................... 2186.8
  p99: ......................................................................... 2231
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 2127
  mean: ........................................................................ 529.8
  median: ...................................................................... 1
  p95: ......................................................................... 2018.7
  p99: ......................................................................... 2101.1
http.response_time.5xx:
  min: ......................................................................... 1229
  max: ......................................................................... 2313
  mean: ........................................................................ 1859.1
  median: ...................................................................... 1901.1
  p95: ......................................................................... 2231
  p99: ......................................................................... 2276.1
http.responses: ................................................................ 234
vusers.completed: .............................................................. 82
vusers.created: ................................................................ 200
vusers.created_by_name.Browse User Profile: .................................... 31
vusers.created_by_name.Full Assessment Attempt Flow: ........................... 126
vusers.created_by_name.List Assessments and Chapters: .......................... 43
vusers.failed: ................................................................. 109
vusers.session_length:
  min: ......................................................................... 1007.2
  max: ......................................................................... 2131.6
  mean: ........................................................................ 1353.3
  median: ...................................................................... 1022.7
  p95: ......................................................................... 2018.7
  p99: ......................................................................... 2101.1


Phase completed: Sustained load (index: 2, duration: 30s) 06:30:38(+0700)

Phase started: Spike (index: 3, duration: 10s) 06:30:38(+0700)

--------------------------------------
Metrics for period to: 06:30:40(+0700) (width: 9.951s)
--------------------------------------

errors.Failed capture or match: ................................................ 113
http.codes.200: ................................................................ 102
http.codes.500: ................................................................ 113
http.downloaded_bytes: ......................................................... 1437819
http.request_rate: ............................................................. 26/sec
http.requests: ................................................................. 250
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 3739
  mean: ........................................................................ 1939.5
  median: ...................................................................... 2566.3
  p95: ......................................................................... 3534.1
  p99: ......................................................................... 3678.4
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 3523
  mean: ........................................................................ 797.3
  median: ...................................................................... 1
  p95: ......................................................................... 3328.3
  p99: ......................................................................... 3464.1
http.response_time.5xx:
  min: ......................................................................... 2100
  max: ......................................................................... 3739
  mean: ........................................................................ 2970.5
  median: ...................................................................... 2951.9
  p95: ......................................................................... 3605.5
  p99: ......................................................................... 3678.4
http.responses: ................................................................ 215
vusers.completed: .............................................................. 64
vusers.created: ................................................................ 213
vusers.created_by_name.Browse User Profile: .................................... 36
vusers.created_by_name.Full Assessment Attempt Flow: ........................... 139
vusers.created_by_name.List Assessments and Chapters: .......................... 38
vusers.failed: ................................................................. 113
vusers.session_length:
  min: ......................................................................... 1008.1
  max: ......................................................................... 3527.6
  mean: ........................................................................ 1858.5
  median: ...................................................................... 1022.7
  p95: ......................................................................... 3395.5
  p99: ......................................................................... 3534.1


Phase completed: Spike (index: 3, duration: 10s) 06:30:48(+0700)

--------------------------------------
Metrics for period to: 06:30:50(+0700) (width: 9.957s)
--------------------------------------

errors.Failed capture or match: ................................................ 111
http.codes.200: ................................................................ 191
http.codes.500: ................................................................ 111
http.downloaded_bytes: ......................................................... 2959360
http.request_rate: ............................................................. 54/sec
http.requests: ................................................................. 463
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 7677
  mean: ........................................................................ 2501.5
  median: ...................................................................... 2
  p95: ......................................................................... 7117
  p99: ......................................................................... 7407.5
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 7237
  mean: ........................................................................ 913.1
  median: ...................................................................... 1
  p95: ......................................................................... 5944.6
  p99: ......................................................................... 7117
http.response_time.5xx:
  min: ......................................................................... 3570
  max: ......................................................................... 7677
  mean: ........................................................................ 5234.8
  median: ...................................................................... 4867
  p95: ......................................................................... 7407.5
  p99: ......................................................................... 7557.1
http.responses: ................................................................ 302
vusers.completed: .............................................................. 112
vusers.created: ................................................................ 383
vusers.created_by_name.Browse User Profile: .................................... 69
vusers.created_by_name.Full Assessment Attempt Flow: ........................... 235
vusers.created_by_name.List Assessments and Chapters: .......................... 79
vusers.failed: ................................................................. 111
vusers.session_length:
  min: ......................................................................... 1007.1
  max: ......................................................................... 7240.9
  mean: ........................................................................ 2282.4
  median: ...................................................................... 1022.7
  p95: ......................................................................... 6702.6
  p99: ......................................................................... 7117


--------------------------------------
Metrics for period to: 06:31:00(+0700) (width: 9.938s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 177
errors.Failed capture or match: ................................................ 42
http.codes.200: ................................................................ 17
http.codes.500: ................................................................ 42
http.downloaded_bytes: ......................................................... 32340
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 5
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 9970
  mean: ........................................................................ 8105
  median: ...................................................................... 8692.8
  p95: ......................................................................... 9801.2
  p99: ......................................................................... 9999.2
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 9810
  mean: ........................................................................ 6413.2
  median: ...................................................................... 8520.7
  p95: ......................................................................... 9801.2
  p99: ......................................................................... 9801.2
http.response_time.5xx:
  min: ......................................................................... 7769
  max: ......................................................................... 9970
  mean: ........................................................................ 8789.7
  median: ...................................................................... 8692.8
  p95: ......................................................................... 9801.2
  p99: ......................................................................... 9999.2
http.responses: ................................................................ 59
vusers.completed: .............................................................. 17
vusers.failed: ................................................................. 219
vusers.session_length:
  min: ......................................................................... 1010.5
  max: ......................................................................... 9812.9
  mean: ........................................................................ 6715.8
  median: ...................................................................... 8520.7
  p95: ......................................................................... 9801.2
  p99: ......................................................................... 9801.2


All VUs finished. Total time: 1 minute, 37 seconds

--------------------------------
Summary report @ 06:31:02(+0700)
--------------------------------

errors.ECONNREFUSED: ........................................................... 2
errors.ECONNRESET: ............................................................. 2
errors.ETIMEDOUT: .............................................................. 177
errors.Failed capture or match: ................................................ 723
http.codes.200: ................................................................ 771
http.codes.500: ................................................................ 723
http.downloaded_bytes: ......................................................... 10215927
http.request_rate: ............................................................. 22/sec
http.requests: ................................................................. 1675
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 9970
  mean: ........................................................................ 1476.8
  median: ...................................................................... 320.6
  p95: ......................................................................... 6976.1
  p99: ......................................................................... 9416.8
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 9810
  mean: ........................................................................ 642.2
  median: ...................................................................... 1
  p95: ......................................................................... 4147.4
  p99: ......................................................................... 8520.7
http.response_time.5xx:
  min: ......................................................................... 237
  max: ......................................................................... 9970
  mean: ........................................................................ 2366.9
  median: ...................................................................... 1686.1
  p95: ......................................................................... 7865.6
  p99: ......................................................................... 9607.1
http.responses: ................................................................ 1494
vusers.completed: .............................................................. 501
vusers.created: ................................................................ 1405
vusers.created_by_name.Browse User Profile: .................................... 268
vusers.created_by_name.Full Assessment Attempt Flow: ........................... 866
vusers.created_by_name.List Assessments and Chapters: .......................... 271
vusers.failed: ................................................................. 904
vusers.session_length:
  min: ......................................................................... 84.6
  max: ......................................................................... 9812.9
  mean: ........................................................................ 1539.6
  median: ...................................................................... 1022.7
  p95: ......................................................................... 5826.9
  p99: ......................................................................... 9230.4
Log file: tests/load/results.json